test/good/never-accessed.cfg.dot
digraph "never-accessed" {
    node [shape=box];
    subgraph "cluster_test1" {
        label="test1";
        "test1_151" [label="let a: Int = 20"];
        "test1_152" [label="if (true)"];
        "test1_154" [label="a = 42"];
        "test1_156" [label="return 42",style=filled,fillcolor="#66A7DB"];
        "test1_151" -> "test1_152";
        "test1_152" -> "test1_154";
        "test1_154" -> "test1_156";
    }
    subgraph "cluster_test2" {
        label="test2";
        "test2_158" [label="while (true)"];
        "test2_159" [label="let a: Int = 0"];
        "test2_158" -> "test2_159";
        "test2_159" -> "test2_158";
    }
    subgraph "cluster_test3" {
        label="test3";
        "test3_162" [label="let a: Int = 20"];
        "test3_163" [label="let b: Int = 22"];
        "test3_165" [label="let c: Int = 24"];
        "test3_167" [label="if (true)"];
        "test3_169" [label="c = a + b"];
        "test3_171" [label="return c",style=filled,fillcolor="#66A7DB"];
        "test3_162" -> "test3_163";
        "test3_163" -> "test3_165";
        "test3_165" -> "test3_167";
        "test3_167" -> "test3_169";
        "test3_169" -> "test3_171";
    }
    subgraph "cluster_test4" {
        label="test4";
        "test4_173" [label="let a: Int = 20"];
        "test4_174" [label="let b: Int = 22"];
        "test4_176" [label="return b",style=filled,fillcolor="#66A7DB"];
        "test4_173" -> "test4_174";
        "test4_174" -> "test4_176";
    }
    subgraph "cluster_FieldTest1__init_1751" {
        label="FieldTest1__init_1751";
        "FieldTest1__init_1751_178" [label="self.f1 = sender()",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_FieldTest1__use_f1" {
        label="FieldTest1__use_f1";
        "FieldTest1__use_f1_179" [label="return self.f1",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_FieldTest1__forEachUse" {
        label="FieldTest1__forEachUse";
        "FieldTest1__forEachUse_180" [label="let foreachmap: map<Address, Address> = self.foreachmap"];
        "FieldTest1__forEachUse_181" [label="foreach ((_, _) of foreachmap)"];
        "FieldTest1__forEachUse_180" -> "FieldTest1__forEachUse_181";
        "FieldTest1__forEachUse_181" -> "FieldTest1__forEachUse_181";
    }
    subgraph "cluster_FieldTest2__init_1763" {
        label="FieldTest2__init_1763";
        "FieldTest2__init_1763_185" [label="self.f1 = sender()",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_ConstantFieldTest__test" {
        label="ConstantFieldTest__test";
        "ConstantFieldTest__test_187" [label="send(SendParameters{to: sender(), bounce: true, value: self.val, mode: SendRemainingValue + SendIgnoreErrors})",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_TestContract__receive_internal_fallback_1801" {
        label="TestContract__receive_internal_fallback_1801";
        "TestContract__receive_internal_fallback_1801_189" [label="let test: Int = 123",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_TestContract2__receive_internal_fallback_1808" {
        label="TestContract2__receive_internal_fallback_1808";
        "TestContract2__receive_internal_fallback_1808_191" [label="let _test: Int = 123",style=filled,fillcolor="#66A7DB"];
    }
}
